In [1]:
import arrow
import pandas as pd
from datetime import datetime
import numpy as np

def convert_todate(df, column_name):
    data_series = []
    len_data = len(df[column_name])
    for idx in range(len_data):
        data = df[column_name].iloc[idx]
        try:
            at = arrow.get(data)
            date = at.date()
            data = date
        except: # jika NAN or NAT
            data = "0000-00-00"

        data_series.append(data)

    df[column_name] = data_series
    return df

In [2]:
df = pd.read_csv("../data/ASET_KDP.csv", sep='|', encoding='ISO-8859-1')

In [3]:
df.head()

,KODE_KL,NAMA_KL,KODE_KPKNL,NAMA_KPKNL,KODE_SATKER,NAMA_SATKER,KODE_SUB_SATKER,NAMA_SUB_SATKER,KELOMPOK,SUB_KELOMPOK,...,STATUS_IDLE,NO_KONTRAK,NAMA_KONTRAK,ALAMAT_KONTRAK,TGL_MULAI,TGL_AKHIR,NILAI_KONTRAK,NILAI_KDP,VALAS_KDP,TGL_TARIK
0,60,KEPOLISIAN NEGARA RI,7104,KPKNL JAKARTA IV,060010100642068000KD,BIRO LOGISTIK POLDA METRO JAYA,060010100642068000KD,BIRO LOGISTIK POLDA METRO JAYA,KONSTRUKSI DALAM PENGERJAAN,KONSTRUKSI DALAM PENGERJAAN,...,NaN,SPP / 05 / IV / 2007 / APBN /,PT. NINDYA KARYA,JL. MT HARIYONO KAV. 22 JAKARTA,2007-04-03 00:00:00.0000000,2007-12-31 00:00:00.0000000,1.666990e+10,1.666990e+10,0.0,20200226
1,60,KEPOLISIAN NEGARA RI,3101,KPKNL PADANG,060010800640647000KD,BIRO SARPRAS POLDA SUMBAR,060010800640647000KD,BIRO SARPRAS POLDA SUMBAR,KONSTRUKSI DALAM PENGERJAAN,KONSTRUKSI DALAM PENGERJAAN,...,NaN,SP/35/VII/2015,PT. TASYA TOTAL PERSADA,JL. WISMA MAYANG SANI BLOK C/04 KEL.BATANG KABUNG,2015-07-23 00:00:00.0000000,2015-12-19 00:00:00.0000000,3.110000e+09,7.277400e+08,0.0,20200226
2,60,KEPOLISIAN NEGARA RI,17101,KPKNL Ambon,060012100665712000KD,POLRES KEPULAUAN ARU,060012100665712000KD,POLRES KEPULAUAN ARU,KONSTRUKSI DALAM PENGERJAAN,KONSTRUKSI DALAM PENGERJAAN,...,NaN,SPK / 32 /VIII / 2017,SUPARDI ARIFIN,Jl. KAPITAN MALONGI - DOBO,2017-08-21 00:00:00.0000000,2017-10-29 00:00:00.0000000,9.320000e+07,9.320000e+07,0.0,20200226
3,60,KEPOLISIAN NEGARA RI,8101,KPKNL BANDUNG,060010200642761000KD,BIRO LOGISTIK POLDA JABAR,060010200642761000KD,BIRO LOGISTIK POLDA JABAR,KONSTRUKSI DALAM PENGERJAAN,KONSTRUKSI DALAM PENGERJAAN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20200226
4,60,KEPOLISIAN NEGARA RI,3101,KPKNL PADANG,060010800640647000KD,BIRO SARPRAS POLDA SUMBAR,060010800640647000KD,BIRO SARPRAS POLDA SUMBAR,KONSTRUKSI DALAM PENGERJAAN,KONSTRUKSI DALAM PENGERJAAN,...,NaN,SP/14/III/2015 TANGGAL 10 MARE,PT. DAYA CIPTA DIANRANCANA,JL. MEKARSARI RAYA NO. 103 BANDUNG,2015-03-17 00:00:00.0000000,2015-12-16 00:00:00.0000000,9.499600e+08,1.899920e+08,0.0,20200226

In [4]:
df.columns

Index(['KODE_KL', 'NAMA_KL', 'KODE_KPKNL', 'NAMA_KPKNL', 'KODE_SATKER',
       'NAMA_SATKER', 'KODE_SUB_SATKER', 'NAMA_SUB_SATKER', 'KELOMPOK',
       'SUB_KELOMPOK', 'KODE_BARANG', 'NAMA_BARANG', 'NUP',
       'TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'NILAI_PEROLEHAN_PERTAMA',
       'NILAI_MUTASI', 'NILAI_PEROLEHAN', 'NILAI_PENYUSUTAN', 'NILAI_BUKU',
       'KONDISI', 'MERK', 'KUANTITAS', 'NO_DANA', 'TGL_DANA', 'DARI',
       'ASL_PERLH', 'TGL_PERLH', 'JUMLAH_FOTO', 'NO_PSP', 'TGL_PSP',
       'STATUS_PENGELOLAAN', 'STATUS_PENGGUNAAN', 'JENIS_PENGGUNA',
       'KD_SATKER_PENGGUNA', 'UR_SATKER_PENGGUNA', 'ALAMAT_SATKER_PENGGUNA',
       'STATUS_SBSN', 'STATUS_IDLE', 'NO_KONTRAK', 'NAMA_KONTRAK',
       'ALAMAT_KONTRAK', 'TGL_MULAI', 'TGL_AKHIR', 'NILAI_KONTRAK',
       'NILAI_KDP', 'VALAS_KDP', 'TGL_TARIK'],
      dtype='object')

In [5]:
cname = ['TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'TGL_DANA','TGL_PERLH',  'TGL_PSP', 'TGL_MULAI', 'TGL_AKHIR',
        'TGL_TARIK']

In [6]:
len(cname)

9

In [7]:
df[cname[0]]

0      2008-12-31 00:00:00.0000000
1      2015-10-15 00:00:00.0000000
2      2017-09-10 00:00:00.0000000
3      2019-12-27 00:00:00.0000000
4      2015-10-01 00:00:00.0000000
                  ...
112    2018-04-20 00:00:00.0000000
113    2018-06-05 00:00:00.0000000
114    2018-06-29 00:00:00.0000000
115    2017-12-13 00:00:00.0000000
116    2017-11-14 00:00:00.0000000
Name: TANGGAL_PEROLEHAN, Length: 117, dtype: object

In [8]:
df = convert_todate(df, column_name=cname[0])
df[cname[0]]

0      2008-12-31
1      2015-10-15
2      2017-09-10
3      2019-12-27
4      2015-10-01
          ...
112    2018-04-20
113    2018-06-05
114    2018-06-29
115    2017-12-13
116    2017-11-14
Name: TANGGAL_PEROLEHAN, Length: 117, dtype: object

In [9]:
df[cname[1]]

0      2008-12-31 00:00:00.0000000
1      2015-10-15 00:00:00.0000000
2      2017-09-10 00:00:00.0000000
3      2019-12-31 00:00:00.0000000
4      2015-10-01 00:00:00.0000000
                  ...
112    2018-04-20 00:00:00.0000000
113    2018-06-05 00:00:00.0000000
114    2018-06-29 00:00:00.0000000
115    2017-12-13 00:00:00.0000000
116    2017-12-22 00:00:00.0000000
Name: TGL_BUKU, Length: 117, dtype: object

In [10]:
df = convert_todate(df, column_name=cname[1])
df[cname[1]]

0      2008-12-31
1      2015-10-15
2      2017-09-10
3      2019-12-31
4      2015-10-01
          ...
112    2018-04-20
113    2018-06-05
114    2018-06-29
115    2017-12-13
116    2017-12-22
Name: TGL_BUKU, Length: 117, dtype: object

In [11]:
df[cname[2]]

0      2008-12-31 00:00:00.0000000
1      2015-10-15 00:00:00.0000000
2      2017-09-10 00:00:00.0000000
3      2019-12-31 00:00:00.0000000
4      2015-10-01 00:00:00.0000000
                  ...
112    2018-04-20 00:00:00.0000000
113    2018-06-05 00:00:00.0000000
114    2018-06-29 00:00:00.0000000
115    2017-12-13 00:00:00.0000000
116    2017-12-22 00:00:00.0000000
Name: TGL_REKAM, Length: 117, dtype: object

In [12]:
df = convert_todate(df, column_name=cname[2])
df[cname[2]]

0      2008-12-31
1      2015-10-15
2      2017-09-10
3      2019-12-31
4      2015-10-01
          ...
112    2018-04-20
113    2018-06-05
114    2018-06-29
115    2017-12-13
116    2017-12-22
Name: TGL_REKAM, Length: 117, dtype: object

In [13]:
tgldana = df[cname[3]]
tgldana

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
112   NaN
113   NaN
114   NaN
115   NaN
116   NaN
Name: TGL_DANA, Length: 117, dtype: float64

In [14]:
strtarik = tgldana.apply(str)

In [15]:
strtarik.head()

0    nan
1    nan
2    nan
3    nan
4    nan
Name: TGL_DANA, dtype: object

In [16]:
df = convert_todate(df, column_name=cname[3])
df[cname[3]]

0      0000-00-00
1      0000-00-00
2      0000-00-00
3      0000-00-00
4      0000-00-00
          ...
112    0000-00-00
113    0000-00-00
114    0000-00-00
115    0000-00-00
116    0000-00-00
Name: TGL_DANA, Length: 117, dtype: object

In [17]:
df[cname[4]]

0      2008-12-31 00:00:00.0000000
1      2015-10-15 00:00:00.0000000
2      2017-09-10 00:00:00.0000000
3      2019-12-27 00:00:00.0000000
4      2015-10-01 00:00:00.0000000
                  ...
112    2018-04-20 00:00:00.0000000
113    2018-06-05 00:00:00.0000000
114    2018-06-29 00:00:00.0000000
115    2017-12-13 00:00:00.0000000
116    2017-11-14 00:00:00.0000000
Name: TGL_PERLH, Length: 117, dtype: object

In [18]:
df = convert_todate(df, column_name=cname[4])
df[cname[4]]

0      2008-12-31
1      2015-10-15
2      2017-09-10
3      2019-12-27
4      2015-10-01
          ...
112    2018-04-20
113    2018-06-05
114    2018-06-29
115    2017-12-13
116    2017-11-14
Name: TGL_PERLH, Length: 117, dtype: object

In [19]:
df[cname[5]]

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
112   NaN
113   NaN
114   NaN
115   NaN
116   NaN
Name: TGL_PSP, Length: 117, dtype: float64

In [20]:
cpsp = df[cname[5]]

In [21]:
strpsp = cpsp.apply(str)
strpsp

0      nan
1      nan
2      nan
3      nan
4      nan
      ...
112    nan
113    nan
114    nan
115    nan
116    nan
Name: TGL_PSP, Length: 117, dtype: object

In [22]:
df = convert_todate(df, column_name=cname[5])
df[cname[5]]

0      0000-00-00
1      0000-00-00
2      0000-00-00
3      0000-00-00
4      0000-00-00
          ...
112    0000-00-00
113    0000-00-00
114    0000-00-00
115    0000-00-00
116    0000-00-00
Name: TGL_PSP, Length: 117, dtype: object

In [23]:
df[cname[6]]

0      2007-04-03 00:00:00.0000000
1      2015-07-23 00:00:00.0000000
2      2017-08-21 00:00:00.0000000
3                              NaN
4      2015-03-17 00:00:00.0000000
                  ...
112                            NaN
113                            NaN
114                            NaN
115    2017-08-03 00:00:00.0000000
116    2017-11-14 00:00:00.0000000
Name: TGL_MULAI, Length: 117, dtype: object

In [24]:
df = convert_todate(df, column_name=cname[6])
df[cname[6]]

0      2007-04-03
1      2015-07-23
2      2017-08-21
3      0000-00-00
4      2015-03-17
          ...
112    0000-00-00
113    0000-00-00
114    0000-00-00
115    2017-08-03
116    2017-11-14
Name: TGL_MULAI, Length: 117, dtype: object

In [25]:
df[cname[7]]

0      2007-12-31 00:00:00.0000000
1      2015-12-19 00:00:00.0000000
2      2017-10-29 00:00:00.0000000
3                              NaN
4      2015-12-16 00:00:00.0000000
                  ...
112                            NaN
113                            NaN
114                            NaN
115    2017-12-20 00:00:00.0000000
116    2017-12-21 00:00:00.0000000
Name: TGL_AKHIR, Length: 117, dtype: object

In [26]:
df = convert_todate(df, column_name=cname[7])
df[cname[7]]

0      2007-12-31
1      2015-12-19
2      2017-10-29
3      0000-00-00
4      2015-12-16
          ...
112    0000-00-00
113    0000-00-00
114    0000-00-00
115    2017-12-20
116    2017-12-21
Name: TGL_AKHIR, Length: 117, dtype: object

In [27]:
df[cname[8]]

0      20200226
1      20200226
2      20200226
3      20200226
4      20200226
         ...
112    20200226
113    20200226
114    20200226
115    20200226
116    20200226
Name: TGL_TARIK, Length: 117, dtype: int64

In [28]:
# declaration df to data variable
data = df
# declaration data series ('TGL_TARIK') to column_name
column_name = 'TGL_TARIK'

len_data = len(df)
# len_data = 10
data_series = []
for idx in range(len_data):
    len_data = len(df[column_name])
    data = df[column_name].iloc[idx]
    data = str(data)
    
    year = data[0:4]
    month = data[4:6]
    day = data[6:8]
    str_date = f'{year}-{month}-{day}'
#     print(str_date)

    try:
        at = arrow.get(str_date)
        date = at.date()
    except:
        str_date = f'0000-00-00'
#         at = arrow.get(str_date)
#         date = at.date()
        date = str_date
#         print(date)
#     print(date)

    data_series.append(date)

df[column_name] = data_series
df[column_name]
# return df

0      2020-02-26
1      2020-02-26
2      2020-02-26
3      2020-02-26
4      2020-02-26
          ...
112    2020-02-26
113    2020-02-26
114    2020-02-26
115    2020-02-26
116    2020-02-26
Name: TGL_TARIK, Length: 117, dtype: object

In [29]:
from sqlalchemy import create_engine

engine = create_engine('mysql://root:191618@localhost/db_logpolri')

In [30]:
df.to_sql('t_ASET_KDP', con=engine, if_exists='append', chunksize=500, index=False)